10/data/attachments/9ab6b6173a28ece6.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_d7692a9d-d0ce-457b-9faf-562185c50258</nif:username>
            <nif:friendToBeAdded>Valerie_fact_Actions_56570_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>